# -*-coding:utf-8-*-
""""
    5、有如下变量，请实现要求的功能
        tu = ("alex", [11, 22, {"k1": 'v1', "k2": ["age", "name"], "k3": (11,22,33)}, 44])
        讲述元组的特性
        请问tu变量中的第一个元素“alex”是否可被修改？
        请问tu变量中的”k2”对应的值是什么类型？是否可以被修改？如果可以，请在其中添加一个元素“Seven”
        请问tu变量中的”k3”对应的值是什么类型？是否可以被修改？如果可以，请在其中添加一个元素“Seven”
"""

# 元组数据不可修改
tu = ("alex", [11, 22, {"k1": 'v1', "k2": ["age", "name"], "k3": (11,22,33)}, 44])
# tu[0]='al'  不可修改

print(type(tu[1][2]['k2']))
tu[1][2]['k2'].append('Sever')
print(tu)
# 元组类型不可添加元素

# tu[1][2]['k3'].append("Seven")
